## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.forms_dynamodb will be created
  + resource "aws_iam_policy" "forms_dynamodb" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing access for Forms ECS task to read and write to the vault"
      + id          = (known after apply)
      + name        = "forms_dynamodb"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault",
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/ReliabilityQueue",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamodb" {
        id          = "arn:aws:iam::687401027353:policy/lambda_dynamobdb"
        name        = "lambda_dynamobdb"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:GetItem",
                          + "dynamodb:UpdateItem",
                            "dynamodb:Scan",
                            "dynamodb:Query",
                          - "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                      ~ Resource = [
                          - "arn:aws:dynamodb:ca-central-1:687401027353:table/VaultForArchivingTestFeature/index/Retrieved-index",
                          - "arn:aws:dynamodb:ca-central-1:687401027353:table/ReliabilityQueue",
                            "arn:aws:dynamodb:ca-central-1:687401027353:table/Vault",
                          - "arn:aws:dynamodb:ca-central-1:687401027353:table/VaultForArchivingTestFeature",
                          + "arn:aws:dynamodb:ca-central-1:687401027353:table/ReliabilityQueue",
                        ]
                      ~ Sid      = "VisualEditor0" -> ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
